<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 



<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;3&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>Auto01</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></a></sub></td>

<td>Scenario 5, Scenario 6</td>

<td>Administrative port 22 (ssh) open to more than 256 IPs from the Internet</td>

</tr>
<tr>

<td>O01-I-SG</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></a></sub></td>

<td>Scenario 9</td>

<td>Outbound "To Any allow Any service" rules to Public IPs</td>

</tr>
<tr>

<td>I21-NI-SG</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></a></sub></td>

<td>Scenario 5</td>

<td>Administrative port 22 (ssh) can enter your network from more than 256 Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 10</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario10 will be created
  + resource "aws_security_group" "Scenario10" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario10"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 10\tmp\Scenario 10.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 10\\tmp\\Scenario 10.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 11</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario11 will be created
  + resource "aws_security_group" "Scenario11" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario11"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with port range(UDP and TCP) and all IP."
        }
      + tags_all               = {
          + "Name" = "SG with port range(UDP and TCP) and all IP."
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 11\tmp\Scenario 11.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 11\\tmp\\Scenario 11.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 12</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario12 will be created
  + resource "aws_security_group" "Scenario12" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario12"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP"
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 12\tmp\Scenario 12.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 12\\tmp\\Scenario 12.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 13</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario13 will be created
  + resource "aws_security_group" "Scenario13" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario13"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and Multiple IP"
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and Multiple IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 13\tmp\Scenario 13.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 13\\tmp\\Scenario 13.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 14</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario14 will be created
  + resource "aws_security_group" "Scenario14" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 50
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 60
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 50
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 60
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario14"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with port range(UDP and TCP) and all Multiple IP"
        }
      + tags_all               = {
          + "Name" = "SG with port range(UDP and TCP) and all Multiple IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 14\tmp\Scenario 14.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 14\\tmp\\Scenario 14.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 15</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario15 will be created
  + resource "aws_security_group" "Scenario15" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario15"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with ICMP protocol"
        }
      + tags_all               = {
          + "Name" = "SG with Rule with ICMP protocol"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 15\tmp\Scenario 15.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 15\\tmp\\Scenario 15.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 16</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario16 will be created
  + resource "aws_security_group" "Scenario16" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario16"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with SG in source"
        }
      + tags_all               = {
          + "Name" = "SG with Rule with SG in source"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 16\tmp\Scenario 16.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 16\\tmp\\Scenario 16.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 17</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.


```
<br>

</details> <!-- End Format Logs -->


<details>
<summary>Analysis Log</summary>
<br>Errors

```

"Cannot read properties of undefined (reading 'aws')"

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 18</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.


```
<br>

</details> <!-- End Format Logs -->


<details>
<summary>Analysis Log</summary>
<br>Errors

```

"Cannot read properties of undefined (reading 'aws')"

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 5</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  Auto01</summary> 

### **Title:**
Administrative port 22 (ssh) open to more than 256 IPs from the Internet

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.3/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  I21-NI-SG</summary> 

### **Title:**
Administrative port 22 (ssh) can enter your network from more than 256 Private IPs

### **Description:**
Allowing access from more than 256 Private IP addresses using the SSH service (TCP/22) is risky.  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from too many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario5: Refreshing state... [id=sg-0a76ddfb4eba2f7c4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario5 will be created
  + resource "aws_security_group" "Scenario5" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "SG with Single port(UDP and TCP) and Multiple IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario5"
        }
      + tags_all               = {
          + "Name" = "Scenario5"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 5\tmp\Scenario 5.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 5\\tmp\\Scenario 5.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 6</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;1&nbsp;High</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  Auto01</summary> 

### **Title:**
Administrative port 22 (ssh) open to more than 256 IPs from the Internet

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.3/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario6 will be created
  + resource "aws_security_group" "Scenario6" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
        ]
      + name                   = "SG with port range(UDP and TCP) and all Multiple IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario6"
        }
      + tags_all               = {
          + "Name" = "Scenario6"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 6\tmp\Scenario 6.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 6\\tmp\\Scenario 6.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 8</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario8 will be created
  + resource "aws_security_group" "Scenario8" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "SG with Rule with SG in source"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario8"
        }
      + tags_all               = {
          + "Name" = "Scenario8"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 8\tmp\Scenario 8.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 8\\tmp\\Scenario 8.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 9</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;1&nbsp;High</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  O01-I-SG</summary> 

### **Title:**
Outbound "To Any allow Any service" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with service Any" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario9 will be created
  + resource "aws_security_group" "Scenario9" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario9"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with all port and all IP"
        }
      + tags_all               = {
          + "Name" = "SG with all port and all IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 9\tmp\Scenario 9.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 9\\tmp\\Scenario 9.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @similAlgo<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD